## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] has changed
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397"
        name                              = "find-a-tp-pr-397"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

      ~ site_config {
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          + x_fd_health_probe = []
                          + x_forwarded_for   = []
                          + x_forwarded_host  = []
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    name                      = "Allow CDN Traffic"
                    # (5 unchanged attributes hidden)
                },
            ]
            # (24 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
        name                              = "findatppr397logs"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              + "104.210.132.161",
              + "4.180.134.74",
            ]
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-397-default/subnets/find-a-tp-pr-397-webappserviceinfra",
            ]
            # (1 unchanged attribute hidden)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397"
              + endpoint_tenant_id   = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            }
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"          = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"   = (sensitive value)
            # (7 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397-fa"
        name                              = "find-a-tp-pr-397-fa"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397"
        name                              = "find-a-tp-pr-397"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_management_lock.resource_group will be created
  + resource "azurerm_management_lock" "resource_group" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "resource-group-level"
      + notes      = "The resource group is not allowed to delete"
      + scope      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-397-kv|find-a-tp-pr-397-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cache/redis/find-a-tp-pr-397-redis-cache|find-a-tp-pr-397-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397falogs|find-a-tp-pr-397-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs|find-a-tp-pr-397-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Logic/workflows/find-a-tp-pr-397-webhook-workflow|find-a-tp-pr-397-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "http" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-397-http"
        name                = "find-a-tp-pr-397-http"
        tags                = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "latency" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-397-cdn-latency"
        name                = "find-a-tp-pr-397-cdn-latency"
        tags                = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-397-webapp-errors"
        name                    = "find-a-tp-pr-397-webapp-errors"
        tags                    = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397"
        name     = "s177d01-ntp-pr-397"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
      ~ ip_rules                   = [
          - "104.210.132.161",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 12 to change, 0 to destroy.
```
</details>